---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RampMaxRunLength
source: html/aeea5107-061e-f828-f6ca-2a9f99821bea.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RampMaxRunLength Property

"Maximum Incline Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RampMaxRunLength { get; }
```